УчетВУправляющихДляГит1/src/InformationRegisters/КВП_ПрилегающаяТерриторияЗдания/КВП_ПрилегающаяТерриторияЗдания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КВП_ПрилегающаяТерриторияЗдания</name>
  <comment>Прилегающая территория здания</comment>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КВП_Здания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <comment>Тип</comment>
    <type>
      <types>CatalogRef.КВП_ПрилегающаяТерритория</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/КВП_ПрилегающаяТерриторияЗдания/Forms/ФормаЗаписи/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик события формы "ПриСозданииНаСервере".
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборОбъект") Тогда
		Запись.Объект = Параметры.ОтборОбъект;
		Элементы.Объект.ТолькоПросмотр = Истина;
	КонецЕсли;

	Если Параметры.Свойство("Тип") Тогда
		Запись.Тип = Параметры.Тип;
	КонецЕсли;
	
	Если Параметры.Свойство("Значение") Тогда
		Запись.Значение = Параметры.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик события формы "ПослеЗаписи".
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьТаблицуПрилегающаяТерритория");
	
КонецПроцедуры

#КонецОбласти
